research_notes/web_meeting12-10-15/web_meeting12-10-2015.org
#+LATEX_HEADER: \usepackage{setspace}\linespread{1}
#+TITLE: Nist web meeting
#+AUTHOR:-------------------------------------------------------------------------------

* SFE schema 8:30 - 10:00
** attendees
    - Nayan chaudhary, zach trautt, anjana, Daniel Sauceda, Ram, Arroyave
** Points
   - Start making something and evolve over time
   - make the schemas reusable
   - Data can be viewed *2* ways
     - material centered
     or
     - paper centered (document centered)
   - build a widget for entering DOI for a paper and gets all bibliography data
     - *TODO*: use zach curl code for pulling bibliography data via DOI
        - contact: Alden Dima, Kari
   - For xml namespaces look at zachs demo on github
     - *TODO*: Review zach trautt github namespaces
   - processing schema should be as generalized as possible
     - we understand that this will not be perfect when we start
      
* Integration xrd equipment 10:30 - 12:00
** attendees
   - Daniel Sauceda, Nayan chaudhary, Raymundo Arroyave, Anjana, Daniel Salas, Ji ma
** Points
   - unstructured data is meaningless to computer (materials data)
   - each institution will have its own repository
   - We want automated data entry computer --> computer
   - How to do this
     - compose or upload data model
	- focus on automation form instrument at a time
	- Do this by making models
     - *TODO* : focus on data model
     - *TODO* : get zachs script for transformation for broker data

** Questions
   - *Q*: Should the supporting data columns and row data be a stored as blob or in the schema?
     - we want to process it at some point
   - *A*: make as unbounded list and put entire thing as a blob. each row could be a quantity or ~columns arrays~. for plotting use columns.
   - *Q*: (Nayan) Should we be dumping ~all~ data into the curator (without knowledge)?
   - *A*: (Zach) Focus on what data is necessary for the data to be ~reuseable~ and capture that. Knowledge will come later
   - *Q*: What about data that is not generated by the machine?
   - *A*: 
   - *Q*: What about capturing histerisis
   - *A*: Proccess of sample becomes processing steps of data steps
     

* Processing structure 1:30 - 3:00
** attendees
   - Daniel Sauceda, Raymundo Arroyave, rudulfo arramayo, Daniel Salas, Ji ma
** Points
   - Handle system for naming each sample
   - store processes as individual paths
     - copy paste operation for making a new 
   - use a sequence of process
   - work *offline*
   - *TODO*: make processing chema
** Questions


* Galaxy presentation 3:00 - 4:30
** attendees
   - Daniel Sauceda, Raymundo Arroyave, rudulfo arramayo, Ricardo Perez, Anjana 
** Points
   - Aramayo presented galaxy

   - *TODO*: incorporate materials scripts into galaxy

** Questions



