research_notes/web_meeting12-10-15/web_meeting12-10-2015.tex
% Created 2015-12-11 Fri 12:56
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{setspace}\linespread{1}
\author{-------------------------------------------------------------------------------}
\date{\today}
\title{Nist web meeting}
\hypersetup{
 pdfauthor={-------------------------------------------------------------------------------},
 pdftitle={Nist web meeting},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.3.1 (Org mode 8.3.2)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{SFE schema 8:30 - 10:00}
\label{sec:orgheadline3}
\subsection{attendees}
\label{sec:orgheadline1}
\begin{itemize}
\item Nayan chaudhary, zach trautt, anjana, Daniel Sauceda, Ram, Arroyave
\end{itemize}
\subsection{Points}
\label{sec:orgheadline2}
\begin{itemize}
\item Start making something and evolve over time
\item make the schemas reusable
\item Data can be viewed \textbf{2} ways
\begin{itemize}
\item material centered
\end{itemize}
or
\begin{itemize}
\item paper centered (document centered)
\end{itemize}
\item build a widget for entering DOI for a paper and gets all bibliography data
\begin{itemize}
\item \textbf{TODO}: use zach curl code for pulling bibliography data via DOI
\begin{itemize}
\item contact: Alden Dima, Kari
\end{itemize}
\end{itemize}
\item For xml namespaces look at zachs demo on github
\begin{itemize}
\item \textbf{TODO}: Review zach trautt github namespaces
\end{itemize}
\item processing schema should be as generalized as possible
\begin{itemize}
\item we understand that this will not be perfect when we start
\end{itemize}
\end{itemize}

\section{Integration xrd equipment 10:30 - 12:00}
\label{sec:orgheadline7}
\subsection{attendees}
\label{sec:orgheadline4}
\begin{itemize}
\item Daniel Sauceda, Nayan chaudhary, Raymundo Arroyave, Anjana, Daniel Salas, Ji ma
\end{itemize}
\subsection{Points}
\label{sec:orgheadline5}
\begin{itemize}
\item unstructured data is meaningless to computer (materials data)
\item each institution will have its own repository
\item We want automated data entry computer --> computer
\item How to do this
\begin{itemize}
\item compose or upload data model
\begin{itemize}
\item focus on automation form instrument at a time
\item Do this by making models
\end{itemize}
\item \textbf{TODO} : focus on data model
\item \textbf{TODO} : get zachs script for transformation for broker data
\end{itemize}
\end{itemize}

\subsection{Questions}
\label{sec:orgheadline6}
\begin{itemize}
\item \textbf{Q}: Should the supporting data columns and row data be a stored as blob or in the schema?
\begin{itemize}
\item we want to process it at some point
\end{itemize}
\item \textbf{A}: make as unbounded list and put entire thing as a blob. each row could be a quantity or \texttt{columns arrays}. for plotting use columns.
\item \textbf{Q}: (Nayan) Should we be dumping \texttt{all} data into the curator (without knowledge)?
\item \textbf{A}: (Zach) Focus on what data is necessary for the data to be \texttt{reuseable} and capture that. Knowledge will come later
\item \textbf{Q}: What about data that is not generated by the machine?
\item \textbf{A}:
\item \textbf{Q}: What about capturing histerisis
\item \textbf{A}: Proccess of sample becomes processing steps of data steps
\end{itemize}


\section{Processing structure 1:30 - 3:00}
\label{sec:orgheadline11}
\subsection{attendees}
\label{sec:orgheadline8}
\begin{itemize}
\item Daniel Sauceda, Raymundo Arroyave, rudulfo arramayo, Daniel Salas, Ji ma
\end{itemize}
\subsection{Points}
\label{sec:orgheadline9}
\begin{itemize}
\item Handle system for naming each sample
\item store processes as individual paths
\begin{itemize}
\item copy paste operation for making a new
\end{itemize}
\item use a sequence of process
\item work \textbf{offline}
\item \textbf{TODO}: make processing chema
\end{itemize}
\subsection{Questions}
\label{sec:orgheadline10}


\section{Galaxy presentation 3:00 - 4:30}
\label{sec:orgheadline15}
\subsection{attendees}
\label{sec:orgheadline12}
\begin{itemize}
\item Daniel Sauceda, Raymundo Arroyave, rudulfo arramayo, Ricardo Perez, Anjana
\end{itemize}
\subsection{Points}
\label{sec:orgheadline13}
\begin{itemize}
\item Aramayo presented galaxy

\item \textbf{TODO}: incorporate materials scripts into galaxy
\end{itemize}

\subsection{Questions}
\label{sec:orgheadline14}
\end{document}
